Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem Properties
The LibraryProfileItem type exposes the following members.
Properties
Name | Description
aProfileItemAnalysisParameters
 An array list with the profile item analysis parameters.
aProfileItemCrossSections |  Obsolete.
 An array list with the profile item cross-sections.
 (Inherited from ProfileItem.)
aProfileItemParameters
 An array list with the profile item parameters.
 (Inherited from ProfileItem.)
aProfileItemUserParameters
 An array list with the profile item user parameters.
IsCLBProfile
 Whether the profile is a clb profile.
 (Inherited from ProfileItem.)
IsHardcodedProfile
 Whether the profile is a parametric user-defined hard coded profile.
 (Inherited from ProfileItem.)
IsMultiCrossSectionUserParametric
 Whether the profile is a parametric user-defined multi cross section profile.
 (Inherited from ProfileItem.)
IsSketchedUserParametric
 Whether the profile is a parametric user-defined sketched profile.
 (Inherited from ProfileItem.)
NumberOfCrossSections
 The number of cross sections in the profile item.
 (Inherited from ProfileItem.)
ParameterString
 The profile item parameter string.
 (Inherited from ProfileItem.)
ProfileItemCrossSections
 The list of profile item cross-sections.
 (Inherited from ProfileItem.)
ProfileItemSubType
 The profile item subtype.
 (Inherited from ProfileItem.)
ProfileItemType
 The profile item type.
 (Inherited from ProfileItem.)
ProfileName
 The profile item name.
Top
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace